import { Grp, Area } from './data-interfaces';

export const GrpList: Grp[] = [
  {
    id: 1,
    personList: ["刘泉蕾", "毛铁林", "贾思雨", "杨俊贤", "何其", "石超林"]
  },
  {
    id: 2,
    personList: ["王茂", "郑钰洁", "张钰", "龚福强", "曾小珊", "陈容"]
  },
  {
    id: 3,
    personList: ["袁小英", "陈韵", "易春燕", "段孝萍", "佘进伟", "唐永圣"]
  },
  {
    id: 4,
    personList: ["王籍英", "苏晓佳", "袁江波", "吴冠佚", "袁乐涵", "赵晓容"]
  },
  {
    id: 5,
    personList: ["斯芮琦", "钱磊", "金珂", "袁鑫睿", "赵益辉", "徐维"]
  },
  {
    id: 6,
    personList: ["黄楠凌", "张奥然", "陈正阳", "廖洲扬", "张晓春", "袁婧"]
  },
  {
    id: 7,
    personList: ["宋高杨", "穆秋佑", "黄榕", "王晓丽", "穆畋宇", "宋光棋"]
  },
  {
    id: 8,
    personList: ["蒋尧毅", "罗洪坤", "叶子", "李小林", "李明杰", "杨康弘"]
  },
  {
    id: 9,
    personList: ["罗敏", "石强正", "袁笙力", "唐樊森", "范萌萌", "曾灵", "付世友"]
  }
]

export const AreaList: Area[] = [{
  name: "教室",
  taskList: [
    "教室 地面扫+拖", "教室 地面扫+拖", "教室 地面扫+拖",
    "走廊 地面扫+拖", "走廊 地面扫+拖", "走廊 地面扫+拖",
    "擦 教室瓷砖 + 走廊瓷砖 + 窗户框 + 门窗蜘蛛网",
    "擦 教室瓷砖 + 走廊瓷砖 + 窗户框 + 门窗蜘蛛网",
    "擦 教室瓷砖 + 走廊瓷砖 + 窗户框 + 门窗蜘蛛网",
    "洗白板 擦讲台", "倒垃圾 + 储物间清理", "倒垃圾 + 储物间清理"
  ]
},
{
  name: "公区",
  taskList: [
    "羽毛球场（门卫到沙坑）", "羽毛球场（门卫到沙坑）",
    "羽毛球场（门卫到沙坑）", "羽毛球场（门卫到沙坑）",
    "羽毛球场（门卫到沙坑）", "水泥跑道 + 鹅卵石",
    "水泥跑道 + 鹅卵石", "沙坑 单杠双杠 区域",
    "沙坑 单杠双杠 区域", "沙坑 单杠双杠 区域",
    "擦花坛 + 清理垃圾", "擦花坛 + 清理垃圾"
  ]
}]
